In [7]:
import pandas as pd 
f500 = pd.read_csv('f500.csv', index_col=0 )
f500.shape

(500, 16)

### 1. 创建一个系列，cities_usa包含总部设在美国的公司的五个最常见的总部位置城市的数量。

In [10]:
# 总部设在美国的公司 布尔索引
bool_usa = f500['country'] == 'USA' 
# 选出总部设在美国的公司的行
usa_rows = f500[bool_usa]
# 选出hd_location 列,# 选出最常见的前5个
cities_usa = usa_rows['hq_location'].value_counts().head()

New York, NY      15
Houston, TX        5
Atlanta, GA        4
Chicago, IL        4
Cincinnati, OH     3
Name: hq_location, dtype: int64

In [12]:
# 获取包含中国的所有行
china_rows = f500[f500['country']=='China']
sector_china = china_rows['sector'].value_counts().head() 
print(sector_china)

Financials                    25
Energy                        22
Wholesalers                    9
Technology                     8
Engineering & Construction     8
Name: sector, dtype: int64

In [13]:
import pandas as pd 
f500 = pd.read_csv('f500.csv', index_col=0 )
f500.index.name = None
f500.shape
#获取日本雇员的平均数量
Japan_rows = f500[f500['country']=='China']
mean_employees_japan = Japan_rows['employees'].mean()
print(mean_employees_japan)

181536.1376146789

In [14]:
f500.iloc[0]

rank                                             1
revenues                                    485873
revenue_change                                 0.8
profits                                      13643
assets                                      198825
profit_change                                 -7.2
ceo                            C. Douglas McMillon
industry                     General Merchandisers
sector                                   Retailing
previous_rank                                    1
country                                        USA
hq_location                        Bentonville, AR
website                     http://www.walmart.com
years_on_global_500_list                        23
employees                                  2300000
total_stockholder_equity                     77798
Name: Walmart, dtype: object

In [18]:
import pandas as pd 
f500 = pd.read_csv('f500.csv', index_col=0 )
f500.index.name = None
f500.iloc[:5, :3]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>rank</th>
      <th>revenues</th>
      <th>revenue_change</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Walmart</th>
      <td>1</td>
      <td>485873</td>
      <td>0.8</td>
    </tr>
    <tr>
      <th>State Grid</th>
      <td>2</td>
      <td>315199</td>
      <td>-4.4</td>
    </tr>
    <tr>
      <th>Sinopec Group</th>
      <td>3</td>
      <td>267518</td>
      <td>-9.1</td>
    </tr>
    <tr>
      <th>China National Petroleum</th>
      <td>4</td>
      <td>262573</td>
      <td>-12.3</td>
    </tr>
    <tr>
      <th>Toyota Motor</th>
      <td>5</td>
      <td>254694</td>
      <td>7.7</td>
    </tr>
  </tbody>
</table>
</div>

In [17]:
f500 = pd.read_csv('f500.csv' )
f500.iloc[:5, :3]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>company</th>
      <th>rank</th>
      <th>revenues</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Walmart</td>
      <td>1</td>
      <td>485873</td>
    </tr>
    <tr>
      <th>1</th>
      <td>State Grid</td>
      <td>2</td>
      <td>315199</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Sinopec Group</td>
      <td>3</td>
      <td>267518</td>
    </tr>
    <tr>
      <th>3</th>
      <td>China National Petroleum</td>
      <td>4</td>
      <td>262573</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Toyota Motor</td>
      <td>5</td>
      <td>254694</td>
    </tr>
  </tbody>
</table>
</div>

In [20]:
import pandas as pd 
f500 = pd.read_csv('f500.csv', index_col=0 )
f500.iloc[:5, :3]

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>rank</th>
      <th>revenues</th>
      <th>revenue_change</th>
    </tr>
    <tr>
      <th>company</th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Walmart</th>
      <td>1</td>
      <td>485873</td>
      <td>0.8</td>
    </tr>
    <tr>
      <th>State Grid</th>
      <td>2</td>
      <td>315199</td>
      <td>-4.4</td>
    </tr>
    <tr>
      <th>Sinopec Group</th>
      <td>3</td>
      <td>267518</td>
      <td>-9.1</td>
    </tr>
    <tr>
      <th>China National Petroleum</th>
      <td>4</td>
      <td>262573</td>
      <td>-12.3</td>
    </tr>
    <tr>
      <th>Toyota Motor</th>
      <td>5</td>
      <td>254694</td>
      <td>7.7</td>
    </tr>
  </tbody>
</table>
</div>